g_stages[27] = {
    title: "通关啦",
    mapStyle: "A",
    map: [
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 6, 6, 1, 7, 7, 7, 7,],
        [1, 5, 5, 5, 5, 5, 5, 5, 5, 1, 1, 1, 1, 9, 1, 7,],
        [5, 5, 5, 5, 5, 1, 5, 5, 5, 1, 1, 5, 5, 5, 1, 1,],
        [5, 5, 5, 5, 5, 5, 5, 5, 5, 1, 5, 5, 5, 5, 5, 5,],
        [5, 5, 5, 5, 5, 5, 5, 5, 5, 1, 5, 5, 5, 5, 5, 5,],
        [1, 1, 5, 5, 5, 5, 5, 1, 1, 1, 1, 1, 5, 5, 5, 5,],
        [1, 1, 1, 1, 1, 1, 1, 4, 4, 4, 4, 1, 5, 5, 1, 1,],
        [1, 1, 1, 1, 1, 1, 4, 4, 6, 1, 4, 4, 1, 5, 1, 7,],
        [4, 4, 4, 1, 1, 6, 6, 1, 7, 7, 7, 1, 1, 5, 5, 1,],
        [1, 4, 4, 4, 4, 4, 4, 4, 1, 7, 1, 1, 5, 5, 5, 5,],
        [7, 7, 7, 1, 1, 1, 1, 4, 4, 1, 1, 5, 5, 5, 5, 5,],
        [1, 7, 7, 7, 1, 1, 1, 1, 1, 1, 1, 1, 5, 5, 5, 5,],
        [1, 1, 5, 5, 1, 1, 1, 1, 1, 7, 1, 5, 5, 5, 5, 5,],
        [5, 5, 5, 5, 5, 5, 5, 5, 1, 1, 5, 5, 5, 5, 5, 5,],
        [5, 5, 5, 5, 5, 5, 5, 5, 1, 5, 5, 5, 5, 5, 5, 5,],
        [5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5,],
    ],
    enemy_init: [
        //x,y,机师,机体,等级,智商
        [2, 3, 53, 160, 49, "5",], //  "贝克", "瓦尔",
        [3, 3, 34, 94, 48, "5",], //  "休", "埃尔",
        
    ],
    robot_init: [
        //x,y,机师,机体,exp
        [9, 6, 6, 142], //  "大卫",
        [10, 6, 8, 123], //  "龙",
        [8, 7, 7, 33], //  "加代",
        [9, 7, 20, 28], //  "安东",
        [8, 8, 13, 146], //  "布克",
        [11, 7, 12, 151], //  "希塔",
        [10, 7, 11, 138], //  "卡姆",
        [9, 8, 14, 102], //  "马丁",
        [10, 8, 16, 112], //  "发",
        [11, 8, 27, 77] //  "伊娃",

    ],
    talk_map: [
        [6, "接近尾声了。"],
        

    ],
    round_event: {
        1: [
            {
                type: "talks",
                data: [
                    [53, "到底来了，形势发展出人意料的快。"],
                    [53, "只要我不死，D·C就不会灭亡！"],
                    [20, "呵！你也一起吗！"],
                    [34, "可能是冤家吧。"],


                ],
            },
        ],

        



        success: [
            {
                type: "talks",
                data: [
                    [34, "怎么了，好象我们败了。"],
                    [53, "很好‥‥‥现在还和我们来往，谢谢你‥‥‥"],
                    [53, "但是，没有比这‥‥‥没法了‥‥‥你‥‥‥应该会有‥‥‥该做的事吧？"],
                    [34, "‥‥‥是啊‥‥‥是你的想法把我引到这里‥‥‥"],
                    [34, "‥‥‥明白了‥‥‥让我从此消失吧。"],
                    [53, "嗯‥‥‥如果碰上我的女儿留乃，代我向她道歉‥‥‥"],
                    [34, "好‥‥‥那么，就到这里吧‥‥‥"],

                ],
            },
            {
                type: "removeRobot",
                data:
                {
                    people: 34,
                },

            },
            {
                type: "talks",
                data: [
                    [53, "好，居然发展得这么强大了‥‥‥那就没问题了‥‥‥"],
                    [53, "象我这年纪的人也该让位了‥‥‥"],
                    [53, "未来是属于你们年轻人的‥‥‥"],
                    [53, "你们一定要记住："],
                    [53, "即使在和平时代，也会爆发战争‥‥‥"],
                    [53, "敢于对抗战争威胁的，只有你们这些年轻的力量。"],
                    [53, "祈求和平是好的，但不能被和平的环境冲昏头脑‥‥‥"],
                    [53, "如果有值得守护的东西，就应该保持勇气和力量。"],
                    [53, "啊‥‥‥啊‥‥‥一切都结束了‥‥‥"],
                    [53, "留乃‥‥‥没能见到你‥‥‥真遗憾‥‥‥"],
                    [53, "我先走了，这是自然规律，不用难过。"],


                    [6, "干掉了吗‥‥‥"],
                    [8, "嗯‥‥‥"],
                    [20, "真不容易呐。"],
                    [7, "我总觉得不对劲。"],
                    [7, "我说的没错吧？我们始终没逃出对方手心。"],
                    [14, "命运这东西多多少少有点是别人强加的。"],
                    [14, "忘了这些，人就会变得自以为是‥‥‥"],
                    [13, "真的会变成那样吗？"],
                    [12, "喂，你们能不能不谈这些烦心的事！"],
                    [12, "已经完了吧？大家都等着呢！"],
                    [8, "是吗，回去找大家吧！"],

                ],
            },

        ]

    },


}