g_stages[8] = {
    title: "圈套",
    mapStyle: "A",
    map: [
        [1, 1, 1, 1, 1, 1, 1, 1, 5, 1, 1, 1, 4, 4, 4, 4, 4, 6, 6, 6, 6, 6, 6, 1, 2, 1, 1, 1,],
        [1, 7, 1, 1, 1, 1, 1, 1, 5, 5, 1, 1, 1, 4, 4, 4, 4, 4, 6, 6, 2, 1, 6, 1, 1, 1, 7, 1,],
        [1, 1, 1, 1, 7, 1, 1, 1, 1, 5, 1, 1, 2, 1, 1, 4, 4, 4, 1, 1, 9, 7, 1, 1, 1, 1, 2, 1,],
        [1, 1, 1, 7, 7, 7, 1, 1, 1, 5, 1, 1, 1, 7, 1, 2, 1, 1, 1, 1, 1, 1, 1, 1, 8, 8, 1, 1,],
        [1, 1, 1, 1, 7, 7, 7, 1, 1, 5, 5, 1, 1, 1, 1, 1, 2, 1, 1, 1, 8, 8, 8, 1, 8, 8, 8, 8,],
        [1, 7, 1, 1, 1, 1, 7, 1, 1, 8, 5, 5, 8, 8, 1, 1, 1, 1, 1, 8, 8, 5, 5, 1, 8, 5, 5, 8,],
        [1, 1, 1, 1, 1, 1, 1, 1, 1, 8, 5, 5, 5, 8, 1, 7, 1, 1, 8, 8, 5, 5, 5, 8, 8, 8, 5, 5,],
        [1, 8, 1, 1, 1, 1, 1, 1, 8, 8, 5, 5, 1, 1, 1, 1, 1, 8, 8, 5, 5, 5, 5, 1, 5, 5, 5, 5,],
        [8, 8, 1, 1, 1, 8, 8, 8, 8, 5, 5, 5, 1, 8, 8, 8, 8, 5, 5, 5, 5, 5, 8, 8, 5, 5, 5, 5,],
        [8, 8, 1, 1, 1, 8, 5, 5, 5, 5, 5, 5, 1, 5, 5, 5, 5, 5, 5, 5, 5, 8, 1, 1, 5, 5, 5, 5,],
        [8, 8, 1, 1, 1, 1, 5, 5, 5, 5, 5, 1, 1, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 1, 5, 5, 5, 5,],
        [5, 5, 1, 1, 1, 1, 1, 1, 1, 1, 1, 7, 1, 1, 1, 1, 5, 5, 5, 5, 5, 5, 1, 1, 1, 5, 5, 5,],
        [5, 5, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 4, 1, 1, 5, 5,],
        [5, 5, 5, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 7, 1, 1, 1, 1, 1, 1, 1, 4, 4, 4, 1, 5,],
        [5, 5, 5, 5, 5, 1, 1, 1, 4, 4, 4, 1, 1, 1, 1, 1, 1, 1, 7, 1, 1, 1, 1, 1, 4, 4, 4, 1,],
        [5, 5, 5, 1, 1, 1, 4, 4, 4, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 4, 1,],
        [5, 5, 1, 1, 1, 1, 1, 4, 4, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 4, 4,],
        [5, 5, 5, 1, 1, 1, 1, 4, 4, 4, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 4, 4,],
        [5, 1, 1, 1, 1, 4, 4, 4, 4, 1, 1, 1, 1, 1, 1, 10, 1, 1, 1, 1, 1, 1, 1, 1, 7, 1, 1, 4,],
        [1, 1, 1, 1, 4, 4, 4, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 7, 7, 1,],
    ],
    enemy_init: [
        //x,y,机师,机体,等级,智商
        [24, 1, 33, 57, 28, "20"], //  "肯特", "加恩",
        [13, 5, 3, 67, 15, "0"], //  "士兵", "马登",
        [14, 5, 3, 67, 15, "0"], //  "士兵", "马登",
        [15, 5, 3, 67, 15, "0"], //  "士兵", "马登",
        [22, 19, 3, 18, 15, "0"], //  "士兵", "卡扎C",
        [23, 18, 3, 18, 15, "0"], //  "士兵", "卡扎C",
        [24, 17, 3, 18, 15, "0"], //  "士兵", "卡扎C",
        [21, 1, 3, 70, 15, "0"], //  "士兵", "巴勒",
        [22, 2, 3, 70, 15, "0"], //  "士兵", "巴勒",
        [23, 3, 3, 70, 15, "0"], //  "士兵", "巴勒",
        [11, 1, 3, 18, 13, "0"], //  "士兵", "卡扎C",
        [11, 2, 3, 18, 13, "0"], //  "士兵", "卡扎C",
        [11, 3, 3, 18, 13, "0"], //  "士兵", "卡扎C",
        [17, 4, 4, 96, 17, "0"], //  "士兵", "米巴X",

        [17, 12, 14, 98, 15, "0"], //  "士兵", "米巴X",
    ],
    robot_init: [
        //x,y,机师,机体,exp
        [17, 15, 7, 30] // "加代"

    ],
    talk_map: [
        [10, "不，凯文是个好人。"],
        [10, "不仅给我们补充物资，还给我们装备了超级武器。"],
        [7, "好极了，我一定把那些家伙都收拾了！"],
        [16, "大家快过来！有个奇怪的呼叫！"],
        [11, "什么？"],
        [33, "嘿‥‥‥你们好象满不在乎嘛。"],
        [33, "我是D·C欧洲战区司令肯特，记住了吗？"],
        [10, "哼，我们的记性可不好。"],
        [33, "的确，你们看上去就有点笨。不过，反正你们马上就要死了。"],
        [10, "恬不知耻的家伙！"],
        [9, "那么，你到底要把我们怎么样？"],
        [33, "你们是想救出古连吧？恐怕是拉英Ｘ告诉你们的。"],
        [8, "......"],
        [33, "好，有话说吧。"],
        [33, "我很清楚你们的目的，我们不会袖手旁观的。"],
        [54, "有什么话直说吧！"],
        [33, "很简单，我们把古连，马丁，夫里德还给你们。"],
        [33, "但有个条件，必须将加代一个人留下来。"],
        [6, "无耻！太无耻了‥‥‥！"],
        [33, "好，那样古连就要被处死。"],
        [33, "我等你们明智的选择。"],

    ],
    round_event: {
        1: [
            {
                type: "talks",
                data: [
                    [33, "哈哈‥‥‥欢迎你，加代。"],
                    [7, "好，我跟你走！放了大介！"],
                    [33, "好，古连就在你的眼前。"],
                    [33, "再不快点就无法挽回了！"],
                    [7, "大介，你没事吧！"],
                ],
            },
           
        ],

        2: [
            {
                type: "talks",
                data: [
                    [7, "嗯？那机器人我在哪儿见过。"],
                    [7, "那和我的金Z很象。"],
                    [4, "‥‥‥"],
                    [7, "确实见过，叫什么来着？"],
                ],
            },
        ],
        3: [
            {
                type: "addRobots",
                data: [
                    //x,y,机师,机体,exp
                    [2, 2, 13, 143], //  "布克",
                    [3, 3, 6, 128], //  "大卫",
                    [2, 4, 8, 6], //  "龙",
                    [4, 2, 11, 132], //  "卡姆",
                    [1, 3, 16, 108], //  "发",
                    [3, 1, 44, 90], //  "卡尔",
                    [1, 1, 54, 162], //  "乔",
                ],
            },
            {
                type: "talks",
                data: [
                    [6, "来得及吗？"],
                    [11, "没事吧？"],
                    [8, "其他都交给我们吧！"],
                    [9, "干得不错！"],
                    [10, "我们一来，马到成功！"],
                    [10, "没事吧？"],
                    [10, "反击开始了！"],
                    [10, "挺能坚持的嘛，加代！"],
                ],
            },


        ],

        10: [
            {
                type: "talks",
                data: [
                    [33, "还有更大的战斗呢！"],
                   
                ],
            },
            {
                type: "addEnemys",
                data: [
                    // 
                    //x,y,机师,机体,等级,智商
                    [26, 0, 2, 85, 16, "0"],
                    [27, 0, 2, 46, 16, "0"],
                    [27, 0, 2, 85, 16, "0"],
                  


                ],
            },

        ],



        success: [
            {
                type: "talks",
                data:
                    [
                        [73, "我败了‥‥‥为了表示敬意，告诉你们个情报。"],
                        [73, "你们的同伴古连被代沙抓住了。"],
                        [73, "小心肯特的诡计‥‥‥"],

                    ]
            },
            {
                type: "addRobots",
                data: [
                    //x,y,机师,机体,exp
                    [7, 12, 18, 39, 3000], // 
                ],
            },
            {
                type: "talks",
                data:
                    [
                        [18, "啊，谢谢，多亏你救了我！"],
                        [7, "这不是布西吗！你怎么也在这儿？"],
                        [18, "哎呀！加代，我本想来帮忙，反而被抓了。"],
                        [7, "真没办法！你不该到处乱跑！"],
                        [18, "我现在能帮什么忙吗？"],
                        [7, "博思已经多余了，你就别添乱了，大家出发！"],
                        [18, "你和加代一样混蛋！让我干什么都行！"],

                    ]
            },
            {
                type: "talks",
                data:
                    [
                        [43, "我‥‥‥留在加洛基地。"],
                        [6, "为什么？"],
                        [43, "大家去敖德萨吧？那里有大佐‥‥‥不，有个叫凯的"],
                        [43, "凯是我的恩人。怎么也不能和他正面相斗‥‥‥"],
                        [6, "是吗‥‥‥那尼娜留在这里保护凯文。"],
                        [43, "大卫真行‥‥‥"],

                    ]
            },
        ]

    },
    immediateEvent: [
        {
            check: {
                type: "hpLessThanMax",
                peopleId: 33,
            },
            events: [
                {
                    type: "talks",
                    data: [
                        [33, "哼，厉害吧？再看这个！"],

                    ],
                },
                {
                    type: "addRobots",
                    data: [
                        //x,y,机师,机体,exp
                        [23, 2, 14, 98, 13380], // 
                    ],
                },
                {
                    type: "talks",
                    data: [
                        [7, "大介！"],
                        [8, "哼！你太无耻了！"],
                        [33, "哼‥‥‥谢谢你的夸奖。"],
                        [33, "你还是乖乖地从机器人上下来吧。"],
                        [13, "哼‥‥‥"],
                        [14, "大家别管我！"],

                    ],
                },
                {
                    type: "playMusic",
                    data: {
                        musicid: "",
                        stopAll: true,

                    },
                },
                {
                    type: "addRobots",
                    data: [
                        //x,y,机师,机体,exp
                        [27, 0, 18, 39, 12120], // 
                    ],
                },
                {
                    type: "talks",
                    data: [
                        [18, "快，博思出马啦！"],
                        [33, "什么？就这笨拙的机器人！？"],
                        [18, "让你见识见识博思的厉害！"],
                    ],
                },
                {
                    type: "moveRobot",
                    data: {
                        people: 18,
                        targetPeople: 33,
                        targetPeopleX: 0,
                        targetPeopleY: -1,
                    },
                },
                {
                    type: "attackRobot",
                    data: {
                        people: 18,
                        weapon: 1,
                        targetPeople: 33,
                        
                    },
                },
                {
                    type: "talks",
                    data: [
                        [14, "快跑！"],
                       
                    ],
                },
                {
                    type: "moveRobot",
                    data: {
                        people: 14,
                        targetPeople: 33,
                        targetPeopleX: 0,
                        targetPeopleY: 1,
                    },
                },
                {
                    type: "attackRobot",
                    data: {
                        people: 14,
                        weapon: 1,
                        targetPeople: 33,
                    },
                },
                {
                    type: "talks",
                    data: [
                        [33, "啊，完了！让那笨拙的机器人打了！"],
                        [33, "嗯，这样的话，你们都要和我作伴啦！"],
                    ],
                },

            ],
        },
        
    ]


}